# Machine Learning CSE4020 L9+L10
## Proff. Sharmila Banu K.
### Sahaj Adlakha (18BCE0054)
Theory Slot - F2

### LAB TASK 2

## Set 1

In [9]:
import pandas as pd
import numpy as np

In [2]:
# Load Dataset
data = pd.read_csv('./crx.data', header = None)

In [4]:
data.head()

  0      1      2  3  4  5  6     7  8  9   10 11 12     13   14 15
0  b  30.83  0.000  u  g  w  v  1.25  t  t   1  f  g  00202    0  +
1  a  58.67  4.460  u  g  q  h  3.04  t  t   6  f  g  00043  560  +
2  a  24.50  0.500  u  g  q  h  1.50  t  f   0  f  g  00280  824  +
3  b  27.83  1.540  u  g  w  v  3.75  t  t   5  t  g  00100    3  +
4  b  20.17  5.625  u  g  w  v  1.71  t  f   0  f  s  00120    0  +

### 1. In the dataset crx.data, name the columns as col1, col2..col16

In [6]:
colNames = ['col'+str(i) for i in range(1,17)]
data.columns = colNames

In [7]:
data.head()

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10,col11,col12,col13,col14,col15,col16
0,b,30.83,0.000,u,g,w,v,1.25,t,t,1,f,g,00202,0,+
1,a,58.67,4.460,u,g,q,h,3.04,t,t,6,f,g,00043,560,+
2,a,24.50,0.500,u,g,q,h,1.50,t,f,0,f,g,00280,824,+
3,b,27.83,1.540,u,g,w,v,3.75,t,t,5,t,g,00100,3,+
4,b,20.17,5.625,u,g,w,v,1.71,t,f,0,f,s,00120,0,+

### 2. Print the last 10 rows of data

In [8]:
data.tail(10)

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10,col11,col12,col13,col14,col15,col16
680,b,19.50,0.290,u,g,k,v,0.290,f,f,0,f,g,00280,364,-
681,b,27.83,1.000,y,p,d,h,3.000,f,f,0,f,g,00176,537,-
682,b,17.08,3.290,u,g,i,v,0.335,f,f,0,t,g,00140,2,-
683,b,36.42,0.750,y,p,d,v,0.585,f,f,0,f,g,00240,3,-
684,b,40.58,3.290,u,g,m,v,3.500,f,f,0,t,s,00400,0,-
685,b,21.08,10.085,y,p,e,h,1.250,f,f,0,f,g,00260,0,-
686,a,22.67,0.750,u,g,c,v,2.000,f,t,2,t,g,00200,394,-
687,a,25.25,13.500,y,p,ff,ff,2.000,f,t,1,t,g,00200,1,-
688,b,17.92,0.205,u,g,aa,v,0.040,f,f,0,f,g,00280,750,-
689,b,35.00,3.375,u,g,c,h,8.290,f,f,0,t,g,00000,0,-

### 3. Replace the ‘?’ with Not-a-Number

In [16]:
data = data.replace('?', np.nan)

### 4. Comment on the datatype of variables

In [26]:
i=1
for ser in data.dtypes:
    print("Column col",i,' is of data type: ', ser )
    i+=1

Column col 1  is of data type:  object
Column col 2  is of data type:  object
Column col 3  is of data type:  float64
Column col 4  is of data type:  object
Column col 5  is of data type:  object
Column col 6  is of data type:  object
Column col 7  is of data type:  object
Column col 8  is of data type:  float64
Column col 9  is of data type:  object
Column col 10  is of data type:  object
Column col 11  is of data type:  int64
Column col 12  is of data type:  object
Column col 13  is of data type:  object
Column col 14  is of data type:  object
Column col 15  is of data type:  int64
Column col 16  is of data type:  object

In [29]:
# more info about the columns
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    678 non-null    object
 1   col2    678 non-null    object
 2   col3    690 non-null    float64
 3   col4    684 non-null    object
 4   col5    684 non-null    object
 5   col6    681 non-null    object
 6   col7    681 non-null    object
 7   col8    690 non-null    float64
 8   col9    690 non-null    object
 9   col10   690 non-null    object
 10  col11   690 non-null    int64
 11  col12   690 non-null    object
 12  col13   690 non-null    object
 13  col14   677 non-null    object
 14  col15   690 non-null    int64
 15  col16   690 non-null    object
dtypes: float64(2), int64(2), object(12)
memory usage: 86.4+ KB

### 5. The col16 has + and -, replace them ‘P’ and ‘N’ respectively

In [27]:
data['col16'] = data['col16'].map({'+':'P', '-':'M'})

In [28]:
data.head()

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10,col11,col12,col13,col14,col15,col16
0,b,30.83,0.000,u,g,w,v,1.25,t,t,1,f,g,00202,0,P
1,a,58.67,4.460,u,g,q,h,3.04,t,t,6,f,g,00043,560,P
2,a,24.50,0.500,u,g,q,h,1.50,t,f,0,f,g,00280,824,P
3,b,27.83,1.540,u,g,w,v,3.75,t,t,5,t,g,00100,3,P
4,b,20.17,5.625,u,g,w,v,1.71,t,f,0,f,s,00120,0,P

### 6. Find and display the number of variables of type ‘Object’

In [35]:
print("The number of columns with data type as object are")
print(data.select_dtypes(include=['object']).shape[1])
print("Those columns are: ")
print(data.select_dtypes(include=['object']).columns)

The number of columns with data type as object are
12
Those columns are:
Index(['col1', 'col2', 'col4', 'col5', 'col6', 'col7', 'col9', 'col10',
       'col12', 'col13', 'col14', 'col16'],
      dtype='object')

In [36]:
# Alternatively:
objcols = [col for col in data.columns if data[col].dtypes == 'object']
print(len(objcols), objcols)

12 ['col1', 'col2', 'col4', 'col5', 'col6', 'col7', 'col9', 'col10', 'col12', 'col13', 'col14', 'col16']

## Set 2

In [37]:
dataLoan = pd.read_csv('./loan.csv')

In [38]:
dataLoan.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN

### 1. Display the mean of any two variables with continuous values

In [44]:
print('Mean of disbursed_amount column is: ',dataLoan['disbursed_amount'].mean())
print('Mean of income column is: ',dataLoan['income'].mean())

Mean of disbursed_amount column is:  14132.2755
Mean of income column is:  71572.28728915

### 2. Print the number of discrete variables

In [45]:
dataLoan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             10000 non-null  int64
 1   disbursed_amount        10000 non-null  float64
 2   interest                10000 non-null  float64
 3   market                  10000 non-null  object
 4   employment              9389 non-null   object
 5   time_employed           9471 non-null   object
 6   householder             10000 non-null  object
 7   income                  10000 non-null  float64
 8   date_issued             10000 non-null  object
 9   target                  10000 non-null  int64
 10  loan_purpose            10000 non-null  object
 11  number_open_accounts    10000 non-null  float64
 12  date_last_payment       10000 non-null  object
 13  number_credit_lines_12  238 non-null    float64
dtypes: float64(5), int64(2), object(7)
memory usage: 1.1+ MB

In [46]:
dataLoan.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN

#### From the above 2 outputs we can infer that discrete variables are of data type 'int64' but the column named 'number_open_accounts' is also a discrete variable but has 'float64' as data type. 
=> We can convert it to 'int64' but it is not asked in the question.

In [52]:
discCol = [col for col in dataLoan.columns if dataLoan[col].dtypes == 'int64']

2

In [53]:
print(len(discCol))

2

### 3. Display the unique values of two variables with discrete values

In [55]:
for col in discCol:
    print(col, 'unique values: ',dataLoan[col].unique())

customer_id unique values:  [   0    1    2 ... 9997 9998 9999]
target unique values:  [0 1]

### 4. Display the Month with most of loans issued date

In [56]:
# converting datatype first
dataLoan['date_issued_dt'] = pd.to_datetime(dataLoan['date_issued'])

In [57]:
# Extracting months and creating a seperate column for it
dataLoan['month'] = dataLoan['date_issued_dt'].dt.month

In [58]:
dataLoan.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12,date_issued_dt,month
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN,2013-06-11,6
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN,2014-05-08,5
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN,2013-10-26,10
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN,2015-08-20,8
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN,2014-07-22,7

In [70]:
# Getting the month value with maximum loans:
dataLoan['month'].value_counts().idxmax()

10

### 5. Display the count of ‘Teacher’ who are ‘Owners’

In [83]:
df = dataLoan[(dataLoan['employment']=='Teacher') &(dataLoan['householder'] == 'OWNER')]
print('Number of teachers who are owners are : ',df.shape[0])

Number of teachers who are owners are :  69

### 6. Display the ‘Employment’ of customers who mostly ‘Rent’

In [105]:
g1 = dataLoan[dataLoan['householder'] == 'RENT']
print("‘Employment’ of customers who mostly ‘Rent’ is :", g1['employment'].value_counts().idxmax())

‘Employment’ of customers who mostly ‘Rent’ is : Teacher